package PetShelterTGBot.constant;

public class Constant {

    /**
     * Константы для общих текстовых сообщений
     */
    public static final String GREETINGS_AT_THE_SHELTER_INFO =
            "Выберете, пожалуйста, вариант из предложенного меню!";
    public static final String RETURN_TO_MENU =
            "Выберете пожалуйста, этот пункт, что бы вернуться, обратно в меню!";
    public static final String BASIC_TERMS =
            "Основные условия:\n \n" +
                    "Мы отдаем животное строго по договору\n" +
                    "Мы обязательно отслеживаем судьбу наших \"выпускников\"\n" +
                    "Мы не отдаем животных на цепь, только в квартиру, в загородный дом или вольер\n" +
                    "Мы проверяем условия содержания у будущих владельцев\n" +
                    "Мы сами привозим наших животных будущим хозяевам\n" +
                    "Мы  всегда благодарны вам за фотоотчеты \"";
    public static final String PET_DELIVERY =
            "Волонтеры приюта могут привезти питомца к вам домой, " +
                    "или вы можете самостоятельно забрать питомца, также можно заказать зоотакси " +
                    "https://zootaximoscow.ru/";
    public static final String REASONS_FOR_REFUSAL_TO_ADOPTION =
            " -  Большое количество животных дома \n" +
                    " -  Нестабильные отношения в семье \n" +
                    " -  Наличие маленьких детей \n" +
                    " -  Съемное жилье \n" +
                    " -  Животное в подарок или для работы                         \n"
                    + "https://kot-pes.com/5-prichin-pochemu-v-priyute-vam-mogut-ne-dat-zhivotnoe/";
    public static final String UPLOAD_PHOTO =
            "Загрузите фото! Нажав на скрепку внизу." +
                    "Ничего вводить в строку как внизу бота, так и при загрузке фото, не нужно!";
    public static final String PHOTO_IS_NOT_UPLOADED =
            "Фото не удалось загрузить! Повторите, пожалуйста, процедуру загрузки отчета!";
    public static final String SUBMISSION_OF_THE_REPORT_CAT =
            "После того как новый усыновитель забрал животное из приюта, " +
                    "он обязан в течение месяца присылать информацию о том, как животное чувствует себя на новом месте. " +
                    "В ежедневный отчет входит следующая информация:\n\n" +
                    "    - Фото животного.\n\n" +
                    "    - Рацион животного.\n\n" +
                    "    - Общее самочувствие и привыкание к новому месту.\n\n" +
                    "    - Изменение в поведении: отказ от старых привычек, приобретение новых.\n \n" +
                    "Отчет нужно присылать каждый день, ограничений в сутках по времени сдачи отчета нет. " +
                    "Каждый день волонтеры осматривают все присланные отчеты после 21:00.\n \n" +
                    "Для создания и отправки отчета,\n выберите кнопку в меню ->   Начать отчет \n" +
                    " и пошагово, введите предложенные Вам позиции";

    /**
     * Константы для текстовых сообщений кошачьего приюта
     */
    public static final String SHELTER_CAT_ADDRESS =
            "Осташковская ул., 14с2, Москва, 129345";
    public static final String REGISTRATION_OF_A_CAR_PASS_CAT_SHELTER =
            "Чтобы оформить пропуск для автомобиля, свяжитесь с охраной кошачьего приюта:\n" +
                    "Телефон охраны: +7 (925) 111-CATS";
    public static final String SAFETY_PRECAUTIONS_CAT_SHELTER =
            "Техника безопасности для кошачьего приюта может включать в себя следующие меры:\n \n" +
                    "Установка камер видеонаблюдения во всех помещениях приюта, чтобы следить за поведением животных и присутствием посетителей.\n \n" +
                    "Введение системы идентификации сотрудников приюта, которая позволит контролировать доступ в здание.\n \n" +
                    "Регулярная обучение персонала правилам безопасности на рабочем месте, пожарной безопасности и первой помощи.\n \n" +
                    "Установка автоматической пожарной сигнализации и противопожарных систем, таких как огнетушители и система полива.\n \n" +
                    "Разделение помещений на зоны для кошек с различными заболеваниями и без них, чтобы предотвратить распространение инфекций и болезней.\n \n" +
                    "Контроль качества пищи и воды, которые используются для кормления животных.\n \n" +
                    "Регулярная дезинфекция и уборка в помещениях, используемых для животных.\n \n" +
                    "Установка противокражных систем для снаряжения и оборудования, используемого в приюте.\n \n" +
                    "Установка ограждений и замков на входных дверях, чтобы предотвратить выход кошек без разрешения.\n \n" +
                    "Обязательное ношение сотрудниками специальной одежды и обуви, чтобы предотвратить распространение инфекций.\n";
    public static final String ADVANTAGE_OF_TREATMENT_CAT_SHELTER =
            "Преимущества обращения в приют за кошкой. \n" +
                    "\n" +
                    "Взять домашнего питомца из приюта - прекрасное решение по ряду причин:\n" +
                    "\n" +
                    "1. Сотрудники приюта подберут вам питомца, подходящего вам по характеру и образу жизни.\n" +
                    "\n" +
                    "2. Вы возьмете уже привитого и стерилизованного/кастрированного друга, то есть не придется заниматься всем этим вам.\n" +
                    "\n" +
                    "3. При выборе взрослой кошки отпадает необходимость и в приучении к лотку или когтеточке.\n" +
                    "\n" +
                    "4. И самое главное: вы подарите дом, заботу и любовь питомцу, который долгое время был один!";
    public static final String PREPARING_THE_HOUSE_FOR_THE_ARRIVAL_OF_AN_CAT =
            "Безопасный и функциональный дом с точки зрения человека может стать смертельно опасным для кошки. Особенно для шаловливых котят, которые везде и во все норовят сунуть свой носик, лизнуть и куснуть.\n" +
                    "\n \n" +
                    "Поэтому, заводя питомца, необходимо оценить все возможные риски и подготовить свой дом для нового обитателя. " +
                    "Итак, все, чем можно отравиться, прячем подальше. Бытовая химия,порошки, шампуни, дезинфицирующие средства," +
                    "лекарства должны быть вне зоны досягаемости котенка. Все, что может разбиться и ранить осколками, а также все, что сердцу дорого, тоже должна постигнуть та же участь. " +
                    "Уделите особое внимание вашим комнатным растениям, может статься, что некоторые из них содержат ядовитый сок в стеблях и листьях, это не страшно для человека, но опасно для кошки, которая, возможно, захочет поживать зелень.   " +
                    "Компьютерные, телевизионные и телефонные провода нужно тоже спрятать от острых зубов котят. Для этих целей существуют специальные пластиковые короба и трубки, которые пускаются либо вдоль плинтуса, либо поднимаются под потолок." +
                    "Прежде чем котенок или взрослая кошка, впервые попавшая в дом, начнет царапать мебель и стены, нужно приобрести когтеточку – высокую, чтобы взрослая особь могла встать на задние лапки и вытянуться во весь рост. " +
                    "Обычно кошки привыкают к своему тренажеру и не покушаются на другие уголки квартиры. Если все же был страстно облюбован угол дивана и никакие отпугиватели не помогают, " +
                    "то придется смириться и оббить этот угол плотным материалом  или приладить когтеточку к нему.\n" +
                    "\n" +
                    "Кроме того вы можете обернуть веревку вокруг стула и ножки стола, чтобы создать когтеточки в разных уголках квартиры";
    public static final String PREPARING_CONDITIONS_FOR_THE_ARRIVAL_OF_AN_CAT =
            " Подготовка к приезду животного\n" +
                    "\n" +
                    "Купите заранее миски для еды и воды. Главное, что стоит учитывать при их выборе – чтобы кошке было удобно ими пользоваться. " +
                    "Специалисты советуют приобрести мисочки трех видов: для влажного корма – неглубокую, для сухого корма – глубокую, а также устойчивую глубокую миску для воды. " +
                    "Пластмассовая посуда менее гигиеничная, чем стеклянная, металлическая или керамическая, поэтому стоит отдать предпочтение этим материалам.\n" +
                    "\n" +
                    "Что касается корма, стоит сказать, что резкая смена привычного питания – это тоже стресс для организма. " +
                    "Если вы берете котенка от заводчика, он подскажет вам, к какому корму приучено животное. " +
                    "Если вы решили взять кошку из приюта, вы также можете попробовать узнать, чем кормили кошку там. " +
                    "Если вас по каким-то причинам не устраивает уже привычная для вашего питомца еда и вы хотите перевести животное на корм другой марки, делайте это постепенно. " +
                    "Специалисты считают, что стоит кормить кошку как раньше неделю или две, " +
                    "а после добавить четверть желаемого корма от порции в привычный рацион с прибавкой 10% нового корма каждый день.\n" +
                    "Обязательно нужно заранее изучить рынок кормов для кошек, почитать отзывы и рекомендации, чтобы выбрать тот, " +
                    "который будет и полезен для вашего питомца, и по карману хозяину. Помните, что правильный корм очень важен для здоровья животного, и, " +
                    "сэкономив на стоимости и качестве корма, вы можете потом стать частым гостем ветеринара.\n" +
                    "\n" +
                    "Подготовьте лоток и определите, где он будет находиться. Кошки – очень чистоплотные животные, поэтому вашей задачей будет своевременно следить за состоянием лотка и держать его в чистоте. " +
                    "С точки зрения гигиены крайне не рекомендуется ставить лоток в комнате, кухне или коридоре. " +
                    "Животному нужно уединение во время пользования туалетом, поэтому эти места также не подходят с точки зрения самой кошки и ее потребностей. " +
                    "Однако если ваша жилплощадь не позволяет разместить лоток в более укромном и подходящем для этого месте (туалет, ванная), стоит обратить внимание на лоток-домик. " +
                    "Учитывайте габариты животного при выборе такого туалета, а также не забывайте следить за его чистотой, " +
                    "ведь такой лоток скрывает от ваших глаз все, что находится внутри и часто снабжен фильтром для ликвидации запаха, отчего, проходя мимо, можно не понять, что за кошкой нужно убрать.\n" +
                    "Помните, что для котенка нужен лоток не глубже 7 сантиметров, а взрослому животному требуется просторный и глубокий туалет. Не забудьте также купить совочек для уборки туалета.\n" +
                    "Что касается наполнителя, основные виды на рынке – минеральный, древесный и силикагелевый. Все они современны и безопасны. У всех, конечно, есть свои нюансы, плюсы и минусы, " +
                    "так что стоит заранее почитать о них в литературе или в Интернете, а также понаблюдать за реакцией животного на конкретный наполнитель.\n" +
                    "\n" +
                    "Подумайте о месте для сна Вашего питомца. В магазинах очень много лежанок и домиков для кошек, поэтому выбор за вами. " +
                    "Желательно обустроить спальное место для животного в спокойном и теплом месте. " +
                    "Большинство кошечек спит в нескольких местах в доме, но для начала достаточно подготовить одно.\n" +
                    "Дополнительно стоит также приобрести когтеточку, расческу для ухода за шерстью и игрушки для досуга.\n" +
                    "\n" +
                    "Очень важный момент – переноска для кошки. Переноски могут быть пластиковые и матерчатые. " +
                    "Учитывайте габариты животного, чтобы ему не было слишком тесно, но и «болтаться» в переноске кошка тоже не должна. " +
                    "Матерчатая сумка-переноска лучше подойдет для транспортировки в холодную погоду, однако в жару животному в ней может быть душно. " +
                    "Также существенный минус – промокаемость. Однако в некоторых случаях именно такая переноска удобнее и коту, и хозяину. " +
                    "Главное помнить, что у сумки должно быть твердое дно, прочная сетка и хорошие замки.\n" +
                    "Пластиковый контейнер больше подойдет для крупных кошек. " +
                    "Он отвечает всем вышеперечисленным требованиям, безопаснее и гигиеничнее, поэтому многие отдают предпочтение именно этому варианту.";
    public static final String CAT_WITH_DISABILITIES =
            "Травмы или тяжёлые инфекционные заболевания могут привести к инвалидности питомца. " +
                    "Наиболее распространённым у кошек считается паралич задних конечностей вследствие травм спинного мозга. " +
                    "В такой ситуации кошка может передвигаться только на передних лапах. " +
                    "Некоторые владельцы не могут смириться с такой бедой и решаются на эвтаназию, но некоторые, наоборот, " +
                    "всячески стараются поддержать любимца. Конечно, питомцу потребуется уделять больше внимания и заботы, но животное," +
                    " в отличие от человека, не будет испытывать психологических проблем от осознания своей инвалидности." +
                    "https://www.belanta.vet/vet-blog/koshki-invalidy-kak-uhazhivat/";

    /**
     * Константы для текстовых сообщений собачьего приюта
     */
    public static final String SHELTER_DOG_ADDRESS =
            "ул. Зорге, вл. 21, Москва, 125252";
    public static final String REGISTRATION_OF_A_CAR_PASS_DOG_SHELTER =
            "Чтобы оформить пропуск для автомобиля, свяжитесь с охраной собачьего приюта:\n" +
                    "Телефон охраны: +7 (925) 222-DOGS";
    public static final String SAFETY_PRECAUTIONS_DOG_SHELTER =
            "Ограждение: Это может быть высокое заборное сооружение или специальный электрический забор, который обеспечивает безопасность собакам и предотвращает их выход за территорию приюта.\n \n" +
                    "Внутреннее пространство: Внутри приюта стенки для собак должны быть прочными и надежными, чтобы предотвратить возможность их побега. Также, внутреннее пространство должно регулярно очищаться и дезинфицироваться, чтобы предотвратить распространение инфекций и заболеваний.\n \n" +
                    "Обучение персонала: Работники приюта должны быть обучены правильному обращению и уходу за собаками, а также знать, как реагировать на возможные опасные ситуации.\n \n" +
                    "Контроль посетителей: В приюте может быть установлена система контроля посетителей, которая обеспечивает безопасность для людей и собак. Также, может быть введена политика посещений, которая ограничивает посещения конкретными группами или индивидуальными посетителями.\n \n" +
                    "Системы мониторинга: Может быть установлены камеры наблюдения и другие системы мониторинга, которые помогают улучшить безопасность в приюте.\n \n";
    public static final String ADVANTAGE_OF_TREATMENT_DOG_SHELTER =
            "В приюте вам приглянулся четвероногий друг, и вы готовы взять его домой.\n" +
                    "Что нужно делать в этом случае?\n" +
                    "Когда вы берете питомца из приюта, вы почти ничего не знаете о нем и его жизни, поэтому лучше расспросить работников приюта.\n" +
                    "Хотя может оказаться так, что они тоже не знают историю вашего нового друга. В приют попадают разные животные: и бездомные, и те, чьим хозяевам пришлось отдать их из-за переезда.\n" +
                    "Дом (или улица), где до вашего знакомства жила собака, формируют ее темперамент и отношения с людьми, поэтому перед тем, как принести пушистого малыша домой, очень важно узнать как можно больше о его прошлом. Ваш новый друг может быть застенчив или испуган из-за всей этой шумихи. Вот несколько советов о том, как подготовить дом и членов семьи к такому событию, как появление нового друга; они также помогут и самой собаке легко пережить переезд.\n" +
                    "Перед тем, как привести нового друга домой\n" +
                    "Прежде всего, нужно подготовить дом и купить необходимые для питомца вещи. Продумайте все: от того какие миски для корма и свежей воды купить для питомца до того какой забор установить на участке, если вы живете за городом и то, какие игрушки вам понадобятся. (Мягкие плюшевые? Резиновые жевательные? Столько вариантов!)\n" +
                    "Вот что обязательно должно быть у вас к появлению собаки в доме (список можно дополнить): миски, ошейник с жетоном, поводок, все для груминга, совок, пакеты и мягкая, удобная лежанка.\n" +
                    "Берете домой собаку? Поставьте детские ограждения на пути в комнаты, куда питомцу нельзя.\n" +
                    "Что касается питания, выбирайте корм для питомца в соответствии с возрастом, состоянием здоровья и индивидуальными потребностями Не расстраивайтесь, если сначала питомцу не понравится корм. Приучение собаки к новому режиму питания происходит путем проб и ошибок. На это может уйти несколько дней.\n" +
                    "Вы берете собаку, и это ваш первый питомец?Найдите хорошего ветеринарного врача в вашем районе и сразу же отведите собаку к нему на осмотр. Если у вас уже есть ветеринарный врач, который консультирует вас по поводу ваших питомцев, свяжитесь с ним до того, как привезете нового друга домой, и попросите дать советы о том, как обеспечить собаке теплый прием.\n";
    public static final String PREPARING_THE_HOUSE_FOR_THE_ARRIVAL_OF_AN_DOG =
            "Когда вы заводите щенка, первым делом нужно найти хорошую ветеринарную клинику, расположенную в вашем районе. Зарегистрируйтесь в ней, если не сделали этого раньше. Так вы сможете быстро получить медицинскую помощь, если вашему питомцу станет плохо, понадобится сделать прививку или стерилизацию.\n" +
                    "Пока вы находитесь в ветеринарной клинике, узнайте о лучших условиях страхования домашних животных — это позволит вам покрыть любые неожиданные расходы, связанные с лечением питомца.\n" +
                    "Для полноценного развития вашего щеночка крайне важно, чтобы он постоянно общался как с другими собаками, так и с людьми. Ветеринарный врач обязательно расскажет о принципах обучения и дрессировки щенят, а практические занятия вы можете выполнять самостоятельно. Обучение — это отличное развлечение, которое помогает собаке и владельцу подружится. В то же время необходимо помнить, что в ходе обучения должны использоваться только те модели дрессировки, которые основаны на похвале и поощрении. Никогда не наказывайте питомца и не используйте при обучении ошейник-удавку, а также ни в коем случае не применяйте иные насильственные методы дрессировки! Если вы берете животное из приюта, его сотрудники наверняка смогут порекомендовать вам профессионального тренера. Вы можете сами найти дрессировщика, который живет неподалеку от вашего дома.\n" +
                    "Всем, кто заводит щенка, рекомендуют прикрепить специальную идентификационную бирку, содержащую информацию о питомце, на его ошейник. По закону в общественных местах на нем всегда должен быть ошейник. Кроме того, собаку рекомендуется чипировать.\n";
    public static final String PREPARING_CONDITIONS_FOR_THE_ARRIVAL_OF_AN_DOG =
            "https://www.adaptil.com/ru/Blog/6-faktorov-kotorye-sleduet-uchest-esli-vy-hotite-vzyat-vzrosluyu-sobaku-iz-priyuta";
    public static final String DOG_WITH_DISABILITIES =
            "Подумайте, стоит ли брать собаку с особыми потребностями. Это собаки, которым нужно постоянное наблюдение у ветеринара, собаки-инвалиды, собаки, которые подвергались насилию и теперь у них есть поведенческие или эмоциональные проблемы.\n" +
                    "Постарайтесь понять потребности собаки, прежде чем выразите свое желание усыновить ее. Собаку с хроническим заболеванием придется часто возить к ветеринару. Убедитесь, что вы сможете оплачивать эти визиты и расходы на содержание и уход за своей собакой.\n" +
                    "Выделите специальное время для собаки. Многие собаки нервничают, когда оказываются в новом доме, особенно это касается собак с особыми потребностями. Постарайтесь уделять собаке как можно больше времени, чтобы она привыкла к вам, к другим членам вашей семьи, к новому дому.\n" +
                    "Спросите в приюте или на передержке: Что особенного мне нужно будет делать, чтобы обеспечить должный уход этой собаке?\n";
    public static final String DOG_HANDLER_ADVICE =
            "Приютская собака пуглива. Обращайтесь с ней ласково! Часто в\n" +
                    "приюте собаки теряют доверие к человеку и не ждут от него\n" +
                    "ничего хорошего, поэтому они могут забиваться в угол,\n" +
                    "зажмуривать глаза и вжимать голову в плечи при попытке\n" +
                    "нового хозяина ее погладить.  Собака может ложиться на землю\n" +
                    "и отказаться идти. И, возможно, даже случайно нагадить, в том\n" +
                    "числе в вашей машине, в которой вы повезете ее в новый дом!\n" +
                    "На полное восстановление доверия собаки понадобится\n" +
                    "несколько недель (ветеринарные врачи называют срок в\n" +
                    "полгода), и вы не имеете права на ошибку: в глазах своего\n" +
                    "питомца в всегда должны быть Самым Добрым и Самым\n" +
                    "Любящим Хозяином. Со временем стресс пройдет, и собака\n" +
                    "заново научится доверять людям. Не стоит в первый же день\n" +
                    "пытаться растормошить собаку, заставить ее играть или\n" +
                    "совершать долгие прогулки: животное станет бояться вас еще\n" +
                    "больше. Дайте ей время успокоиться и привыкнуть к новой\n" +
                    "обстановке – она ответит привязанностью на ваше терпение\n" +
                    "и будет обожать свой дом.\n";
    public static final String RECOMMENDATIONS_FROM_PROVEN_DOG_HANDLERS =
            "Кинологический центр города Москва:\n" +
                    "https://centr-sobak.ru/\n" +
                    "https://www.yasenevo-dog.ru/glavnay";

}